semihurtekin/c2000_motor_control/00_platform/ti/f28379d/source/platform_interrupt.c
/**
 * @file    platform_interrupt.c
 * @brief   F28379D interrupt vector integration implementation.
 */

#include <stddef.h>

#include "platform_interrupt.h"
#include "F2837xD_device.h"

Platform_IntStatusType Platform_IntSetTimer0(
    Platform_IsrType handler)
{
    Platform_IntStatusType status;

    if(handler != NULL)
    {
        EALLOW;

        PieVectTable.TIMER0_INT = handler;

        EDIS;

        status = PLATFORM_INT_STATUS_OK;
    }
    else
    {
        status = PLATFORM_INT_STATUS_INV_ARG;
    }

    return status;
}

Platform_IntStatusType Platform_IntSetAdca1(
    Platform_IsrType handler)
{
    Platform_IntStatusType status;

    if(handler != NULL)
    {
        EALLOW;
        PieVectTable.ADCA1_INT = handler;
        EDIS;

        status = PLATFORM_INT_STATUS_OK;
    }
    else
    {
        status = PLATFORM_INT_STATUS_INV_ARG;
    }

    return status;
}

Platform_IntStatusType Platform_IntSetAdcb1(
    Platform_IsrType handler)
{
    Platform_IntStatusType status;

    if(handler != NULL)
    {
        EALLOW;
        PieVectTable.ADCB1_INT = handler;
        EDIS;

        status = PLATFORM_INT_STATUS_OK;
    }
    else
    {
        status = PLATFORM_INT_STATUS_INV_ARG;
    }

    return status;
}

Platform_IntStatusType Platform_IntSetDmaCh1(
    Platform_IsrType handler)
{
    Platform_IntStatusType status;

    if(handler != NULL)
    {
        EALLOW;
        PieVectTable.DMA_CH1_INT = handler;
        EDIS;

        status = PLATFORM_INT_STATUS_OK;
    }
    else
    {
        status = PLATFORM_INT_STATUS_INV_ARG;
    }

    return status;
}
